Revit 2026 API

# ExportLinetypeTableGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportLinetypeKey, ExportLinetypeInfo))
```
```cpp
public:
virtual IEnumerator<KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^>>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
```

#### Return Value

IEnumeratorKeyValuePairExportLinetypeKey, ExportLinetypeInfoAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

ExportLinetypeTable Class

Autodesk.Revit.DB Namespace